app/Models/base/DashboardModel.php

SELECT *
FROM `users`
WHERE `username` = 'addrmwn'
---
    public function getuser($where)
    {
        $builder = $this->users;
        $query = $builder->getWhere(['username' => $where]);

SELECT *
FROM `router`
---
    public function get_router()
    {
        $builder = $this->router;
        $query = $builder->get();

UPDATE `users` SET `username` = 'addrmwn', `password` = '$2y$10$QXUlotegjvzWprFEf.xy3.vBvx4416aYbzf3BSez0qf2pd7nrh0xG'
WHERE `id` = '1'
---
    public function updateuser($data)
    {
        $builder = $this->users;
        $builder->where('id', $_SESSION['id']);
        return $builder->update($data);